<template>
    <el-card>
        <div>
            <h1>计算机导论</h1>
            <p>
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                《计算机导论》作为计算机专业学生的第一门专业课，主要目的是通过学习该课，
                使学生对计算机系统有一个初步、系统的了解；以及使学生对以后要学习的内容
                有一个初步的了解；并就以后要学习的内容与计算机科学的关系，以后要学习的
                不同内容之间的关系等有一个全面的认识；并通过学习该课，使学生达到熟练操
                作计算机的目的。
            </p>
            <p>
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                基于上述目的，该课主要包括计算机的发展、计算机硬件、计算机软件以及计算
                机网络与多媒体技术四大部分。其中计算机的发展主要介绍计算机的发展历史、
                计算机中常用的计数制及不同数制之间的转换关系、计算机系统的概念等；计算
                机硬件部分主要讲述计算机的输入、输出、CPU、内部存储器和外部存储器的特
                点、型号及其如何进行相互协调地工作；计算机软件部分主要讲述操作系统、编
                程的基本知识以及常用应用软件的介绍等；计算机网络与多媒体技术主要讲述网
                络中信息的传输、Internet的基本知识和多媒体技术的基本知识。
            </p>
        </div>
    </el-card>
</template>

<script>
export default {

}
</script>

<style>

</style>